set_attribute input_pragma_keyword "cadence synopsys get2chip g2c fast ambit pragma"
include compile.rc

read_hdl -vhdl -lib work rtl/ddr4ram.vhd
read_hdl -vhdl -lib work rtl/axi_mig4_7series.vhd
read_hdl -vhdl -lib work rtl/ahb2axi_mig4_7series.vhd
read_hdl -vhdl -lib work rtl/sgmii_kcu105.vhd
read_hdl -vhdl -lib work config.vhd
read_hdl -vhdl -lib work ahbrom128.vhd
read_hdl -vhdl -lib work leon5mp.vhd
elaborate leon5mp
